GopalSaraf/Practicals/PSDL/include/proc/pic18lf26j13.inc
#define RA5                              BANKMASK(PORTA), 5, a
#define RA6                              BANKMASK(PORTA), 6, a
#define RA7                              BANKMASK(PORTA), 7, a
#define RB0                              BANKMASK(PORTB), 0, a
#define RB1                              BANKMASK(PORTB), 1, a
#define RB2                              BANKMASK(PORTB), 2, a
#define RB3                              BANKMASK(PORTB), 3, a
#define RB4                              BANKMASK(PORTB), 4, a
#define RB5                              BANKMASK(PORTB), 5, a
#define RB6                              BANKMASK(PORTB), 6, a
#define RB7                              BANKMASK(PORTB), 7, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC0                              BANKMASK(PORTC), 0, a
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 5, a
#define RC2IF                            BANKMASK(PIR3), 5, a
#define RC2IP                            BANKMASK(IPR3), 5, a
#define RC3                              BANKMASK(PORTC), 3, a
#define RC4                              BANKMASK(PORTC), 4, a
#define RC5                              BANKMASK(PORTC), 5, a
#define RC6                              BANKMASK(PORTC), 6, a
#define RC7                              BANKMASK(PORTC), 7, a
#define RC8_9                            BANKMASK(RCSTA1), 6, a
#define RC8_92                           BANKMASK(RCSTA2), 6, a
#define RC9                              BANKMASK(RCSTA1), 6, a
#define RC92                             BANKMASK(RCSTA2), 6, a
#define RCD8                             BANKMASK(RCSTA1), 0, a
#define RCD82                            BANKMASK(RCSTA2), 0, a
#define RCEN1                            BANKMASK(SSP1CON2), 3, a
#define RCEN2                            BANKMASK(SSP2CON2), 3, a
#define RCIDL1                           BANKMASK(BAUDCON1), 6, a
#define RCIDL2                           BANKMASK(BAUDCON2), 6, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RCMT                             BANKMASK(BAUDCON1), 6, a
#define RCMT1                            BANKMASK(BAUDCON1), 6, a
#define RCMT2                            BANKMASK(BAUDCON2), 6, a
#define RD163                            BANKMASK(T3CON), 7, a
#define RD165                            BANKMASK(T5CON), 1, b
#define READ_WRITE                       BANKMASK(SSP1STAT), 2, a
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2, a
#define REFO                             BANKMASK(PORTB), 2, a
#define REGSLP                           BANKMASK(WDTCON), 7, a
#define RELEASE                          BANKMASK(DSCONL), 0, b
#define RI                               BANKMASK(RCON), 4, a
#define RJPU                             BANKMASK(PORTA), 7, a
#define RODIV0                           BANKMASK(REFOCON), 0, b
#define RODIV1                           BANKMASK(REFOCON), 1, b
#define RODIV2                           BANKMASK(REFOCON), 2, b
#define RODIV3                           BANKMASK(REFOCON), 3, b
#define ROON                             BANKMASK(REFOCON), 7, b
#define ROSEL                            BANKMASK(REFOCON), 4, b
#define ROSSLP                           BANKMASK(REFOCON), 5, b
#define RP0                              BANKMASK(PORTA), 0, a
#define RP1                              BANKMASK(PORTA), 1, a
#define RP10                             BANKMASK(PORTB), 7, a
#define RP11                             BANKMASK(PORTC), 0, a
#define RP12                             BANKMASK(PORTC), 1, a
#define RP13                             BANKMASK(PORTC), 2, a
#define RP14                             BANKMASK(PORTC), 3, a
#define RP15                             BANKMASK(PORTC), 4, a
#define RP16                             BANKMASK(PORTC), 5, a
#define RP17                             BANKMASK(PORTC), 6, a
#define RP18                             BANKMASK(PORTC), 7, a
#define RP2                              BANKMASK(PORTA), 5, a
#define RP3                              BANKMASK(PORTB), 0, a
#define RP4                              BANKMASK(PORTB), 1, a
#define RP5                              BANKMASK(PORTB), 2, a
#define RP6                              BANKMASK(PORTB), 3, a
#define RP7                              BANKMASK(PORTB), 4, a
#define RP8                              BANKMASK(PORTB), 5, a
#define RP9                              BANKMASK(PORTB), 6, a
#define RSEN1                            BANKMASK(SSP1CON2), 1, a
#define RSEN2                            BANKMASK(SSP2CON2), 1, a
#define RTCC                             BANKMASK(PORTB), 1, a
#define RTCCIE                           BANKMASK(PIE3), 0, a
#define RTCCIF                           BANKMASK(PIR3), 0, a
#define RTCCIP                           BANKMASK(IPR3), 0, a
#define RTCCMD                           BANKMASK(PMDIS1), 5, b
#define RTCEN                            BANKMASK(RTCCFG), 7, b
#define RTCOE                            BANKMASK(RTCCFG), 2, b
#define RTCPTR0                          BANKMASK(RTCCFG), 0, b
#define RTCPTR1                          BANKMASK(RTCCFG), 1, b
#define RTCSYNC                          BANKMASK(RTCCFG), 4, b
#define RTCWDIS                          BANKMASK(DSCONH), 0, b
#define RTCWREN                          BANKMASK(RTCCFG), 5, b
#define RTSECSEL0                        BANKMASK(PADCFG1), 1, b
#define RTSECSEL1                        BANKMASK(PADCFG1), 2, b
#define RW                               BANKMASK(SSP1STAT), 2, a
#define RW1                              BANKMASK(SSP1STAT), 2, a
#define RW2                              BANKMASK(SSP2STAT), 2, a
#define RX1                              BANKMASK(PORTC), 7, a
#define RX91                             BANKMASK(RCSTA1), 6, a
#define RX92                             BANKMASK(RCSTA2), 6, a
#define RX9D1                            BANKMASK(RCSTA1), 0, a
#define RX9D2                            BANKMASK(RCSTA2), 0, a
#define RXB0IE                           BANKMASK(PIE3), 0, a
#define RXB1IE                           BANKMASK(PIE3), 1, a
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXCKP                            BANKMASK(BAUDCON1), 5, a
#define RXDTP1                           BANKMASK(BAUDCON1), 5, a
#define RXDTP2                           BANKMASK(BAUDCON2), 5, a
#define RXINC                            BANKMASK(DMACON1), 4, a
#define R_NOT_W2                         BANKMASK(SSP2STAT), 2, a
#define R_W                              BANKMASK(SSP1STAT), 2, a
#define R_W2                             BANKMASK(SSP2STAT), 2, a
#define R_nW2                            BANKMASK(SSP2STAT), 2, a
#define S2                               BANKMASK(SSP2STAT), 3, a
#define SCK1                             BANKMASK(PORTC), 3, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCKP2                            BANKMASK(BAUDCON2), 4, a
#define SCL1                             BANKMASK(PORTC), 3, a
#define SCL2                             BANKMASK(PORTB), 4, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDA1                             BANKMASK(PORTC), 4, a
#define SDA2                             BANKMASK(PORTB), 5, a
#define SDI1                             BANKMASK(PORTC), 4, a
#define SDO1                             BANKMASK(PORTC), 5, a
#define SEN1                             BANKMASK(SSP1CON2), 0, a
#define SEN2                             BANKMASK(SSP2CON2), 0, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, a
#define SMP1                             BANKMASK(SSP1STAT), 7, a
#define SMP2                             BANKMASK(SSP2STAT), 7, a
#define SOSCDRV                          BANKMASK(OSCCON2), 4, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SOSCEN5                          BANKMASK(T5CON), 3, b
#define SOSCGO                           BANKMASK(OSCCON2), 3, a
#define SOSCRUN                          BANKMASK(OSCCON2), 6, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, a
#define SPI1MD                           BANKMASK(PMDIS0), 1, b
#define SPI1OD                           BANKMASK(ODCON3), 0, b
#define SPI2MD                           BANKMASK(PMDIS0), 2, b
#define SPI2OD                           BANKMASK(ODCON3), 1, b
#define SRC0                             BANKMASK(ADCTRIG), 0, b
#define SRC1                             BANKMASK(ADCTRIG), 1, b
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, a
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SSCON0                           BANKMASK(DMACON1), 6, a
#define SSCON1                           BANKMASK(DMACON1), 7, a
#define SSP1IE                           BANKMASK(PIE1), 3, a
#define SSP1IF                           BANKMASK(PIR1), 3, a
#define SSP1IP                           BANKMASK(IPR1), 3, a
#define SSP2IE                           BANKMASK(PIE3), 7, a
#define SSP2IF                           BANKMASK(PIR3), 7, a
#define SSP2IP                           BANKMASK(IPR3), 7, a
#define SSPEN1                           BANKMASK(SSP1CON1), 5, a
#define SSPEN2                           BANKMASK(SSP2CON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM01                           BANKMASK(SSP1CON1), 0, a
#define SSPM02                           BANKMASK(SSP2CON1), 0, a
#define SSPM11                           BANKMASK(SSP1CON1), 1, a
#define SSPM12                           BANKMASK(SSP2CON1), 1, a
#define SSPM21                           BANKMASK(SSP1CON1), 2, a
#define SSPM22                           BANKMASK(SSP2CON1), 2, a
#define SSPM31                           BANKMASK(SSP1CON1), 3, a
#define SSPM32                           BANKMASK(SSP2CON1), 3, a
#define SSPOV1                           BANKMASK(SSP1CON1), 6, a
#define SSPOV2                           BANKMASK(SSP2CON1), 6, a
#define START                            BANKMASK(SSP1STAT), 3, a
#define START1                           BANKMASK(SSP1STAT), 3, a
#define START2                           BANKMASK(SSP2STAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSP1STAT), 4, a
#define STOP1                            BANKMASK(SSP1STAT), 4, a
#define STOP2                            BANKMASK(SSP2STAT), 4, a
#define STRA2                            BANKMASK(PSTR2CON), 0, a
#define STRA3                            BANKMASK(PSTR3CON), 0, b
#define STRB2                            BANKMASK(PSTR2CON), 1, a
#define STRB3                            BANKMASK(PSTR3CON), 1, b
#define STRC2                            BANKMASK(PSTR2CON), 2, a
#define STRC3                            BANKMASK(PSTR3CON), 2, b
#define STRD2                            BANKMASK(PSTR2CON), 3, a
#define STRD3                            BANKMASK(PSTR3CON), 3, b
#define STRSYNC2                         BANKMASK(PSTR2CON), 4, a
#define STRSYNC3                         BANKMASK(PSTR3CON), 4, b
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC1                            BANKMASK(TXSTA1), 4, a
#define SYNC2                            BANKMASK(TXSTA2), 4, a
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T1CKI                            BANKMASK(PORTC), 0, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1DONE                           BANKMASK(T1GCON), 3, a
#define T1GGO                            BANKMASK(T1GCON), 3, a
#define T1GGO_NOT_T1DONE                 BANKMASK(T1GCON), 3, a
#define T1GGO_nT1DONE                    BANKMASK(T1GCON), 3, a
#define T1GPOL                           BANKMASK(T1GCON), 6, a
#define T1GSPM                           BANKMASK(T1GCON), 4, a
#define T1GSS0                           BANKMASK(T1GCON), 0, a
#define T1GSS1                           BANKMASK(T1GCON), 1, a
#define T1GTM                            BANKMASK(T1GCON), 5, a
#define T1GVAL                           BANKMASK(T1GCON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1OSI                            BANKMASK(PORTC), 1, a
#define T1OSO                            BANKMASK(PORTC), 0, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3DONE                           BANKMASK(T3GCON), 3, a
#define T3GGO                            BANKMASK(T3GCON), 3, a
#define T3GGO_T3DONE                     BANKMASK(T3GCON), 3, a
#define T3GPOL                           BANKMASK(T3GCON), 6, a
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GCON), 0, a
#define T3GSS1                           BANKMASK(T3GCON), 1, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3OSCEN                          BANKMASK(T3CON), 3, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T4CKPS0                          BANKMASK(T4CON), 0, a
#define T4CKPS1                          BANKMASK(T4CON), 1, a
#define T4OUTPS0                         BANKMASK(T4CON), 3, a
#define T4OUTPS1                         BANKMASK(T4CON), 4, a
#define T4OUTPS2                         BANKMASK(T4CON), 5, a
#define T4OUTPS3                         BANKMASK(T4CON), 6, a
#define T5CKPS0                          BANKMASK(T5CON), 4, b
#define T5CKPS1                          BANKMASK(T5CON), 5, b
#define T5DONE                           BANKMASK(T5GCON), 3, b
#define T5GGO                            BANKMASK(T5GCON), 3, b
#define T5GGO_NOT_T5DONE                 BANKMASK(T5GCON), 3, b
#define T5GGO_nT5DONE                    BANKMASK(T5GCON), 3, b
#define T5GPOL                           BANKMASK(T5GCON), 6, b
#define T5GSPM                           BANKMASK(T5GCON), 4, b
#define T5GSS0                           BANKMASK(T5GCON), 0, b
#define T5GSS1                           BANKMASK(T5GCON), 1, b
#define T5GTM                            BANKMASK(T5GCON), 5, b
#define T5GVAL                           BANKMASK(T5GCON), 2, b
#define T5OSCEN                          BANKMASK(T5CON), 3, b
#define T6CKPS0                          BANKMASK(T6CON), 0, b
#define T6CKPS1                          BANKMASK(T6CON), 1, b
#define T6OUTPS0                         BANKMASK(T6CON), 3, b
#define T6OUTPS1                         BANKMASK(T6CON), 4, b
#define T6OUTPS2                         BANKMASK(T6CON), 5, b
#define T6OUTPS3                         BANKMASK(T6CON), 6, b
#define T8CKPS0                          BANKMASK(T8CON), 0, b
#define T8CKPS1                          BANKMASK(T8CON), 1, b
#define T8OUTPS0                         BANKMASK(T8CON), 3, b
#define T8OUTPS1                         BANKMASK(T8CON), 4, b
#define T8OUTPS2                         BANKMASK(T8CON), 5, b
#define T8OUTPS3                         BANKMASK(T8CON), 6, b
#define TGEN                             BANKMASK(CTMUCONH), 4, a
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS0                          BANKMASK(T1CON), 6, a
#define TMR1CS1                          BANKMASK(T1CON), 7, a
#define TMR1GE                           BANKMASK(T1GCON), 7, a
#define TMR1GIE                          BANKMASK(PIE5), 0, a
#define TMR1GIF                          BANKMASK(PIR5), 0, a
#define TMR1GIP                          BANKMASK(IPR5), 0, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1MD                           BANKMASK(PMDIS1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2MD                           BANKMASK(PMDIS1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS0                          BANKMASK(T3CON), 6, a
#define TMR3CS1                          BANKMASK(T3CON), 7, a
#define TMR3GE                           BANKMASK(T3GCON), 7, a
#define TMR3GIE                          BANKMASK(PIE3), 1, a
#define TMR3GIF                          BANKMASK(PIR3), 1, a
#define TMR3GIP                          BANKMASK(IPR3), 1, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3MD                           BANKMASK(PMDIS1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TMR4IE                           BANKMASK(PIE3), 3, a
#define TMR4IF                           BANKMASK(PIR3), 3, a
#define TMR4IP                           BANKMASK(IPR3), 3, a
#define TMR4MD                           BANKMASK(PMDIS1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 2, a
#define TMR5CS0                          BANKMASK(T5CON), 6, b
#define TMR5CS1                          BANKMASK(T5CON), 7, b
#define TMR5GE                           BANKMASK(T5GCON), 7, b
#define TMR5GIE                          BANKMASK(PIE5), 1, a
#define TMR5GIF                          BANKMASK(PIR5), 1, a
#define TMR5GIP                          BANKMASK(IPR5), 1, a
#define TMR5IE                           BANKMASK(PIE5), 2, a
#define TMR5IF                           BANKMASK(PIR5), 2, a
#define TMR5IP                           BANKMASK(IPR5), 2, a
#define TMR5MD                           BANKMASK(PMDIS2), 3, b
#define TMR5ON                           BANKMASK(T5CON), 0, b
#define TMR6IE                           BANKMASK(PIE5), 3, a
#define TMR6IF                           BANKMASK(PIR5), 3, a
#define TMR6IP                           BANKMASK(IPR5), 3, a
#define TMR6MD                           BANKMASK(PMDIS2), 4, b
#define TMR6ON                           BANKMASK(T6CON), 2, b
#define TMR8IE                           BANKMASK(PIE5), 4, a
#define TMR8IF                           BANKMASK(PIR5), 4, a
#define TMR8IP                           BANKMASK(IPR5), 4, a
#define TMR8MD                           BANKMASK(PMDIS2), 6, b
#define TMR8ON                           BANKMASK(T8CON), 2, b
#define TO                               BANKMASK(RCON), 3, a
#define TRIGSEL0                         BANKMASK(ADCTRIG), 0, b
#define TRIGSEL1                         BANKMASK(ADCTRIG), 1, b
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRMT1                            BANKMASK(TXSTA1), 1, a
#define TRMT2                            BANKMASK(TXSTA2), 1, a
#define TUN0                             BANKMASK(OSCTUNE), 0, a
#define TUN1                             BANKMASK(OSCTUNE), 1, a
#define TUN2                             BANKMASK(OSCTUNE), 2, a
#define TUN3                             BANKMASK(OSCTUNE), 3, a
#define TUN4                             BANKMASK(OSCTUNE), 4, a
#define TUN5                             BANKMASK(OSCTUNE), 5, a
#define TX1                              BANKMASK(PORTC), 6, a
#define TX1IE                            BANKMASK(PIE1), 4, a
#define TX1IF                            BANKMASK(PIR1), 4, a
#define TX1IP                            BANKMASK(IPR1), 4, a
